# Relatório de Análise IV

In [63]:
import pandas as pd

In [64]:
dados = pd.read_csv('dados/alguel_dados_residencial.csv', sep=';')

In [65]:
dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
22326,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
22327,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
22328,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
22329,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
22330,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

In [81]:
dados_tipo = dados['Tipo']

In [106]:
# Selecione somente os imóveis classificados com tipo 'Apartamento'
selecao = dados_tipo == 'Apartamento'

n1 = dados[selecao].shape[0]

print(f'Imóveis classificados com tipo "Apartamento": {n1}')

Imóveis classificados com tipo "Apartamento": 19532

In [107]:
# Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio'e 'Casa de Vila'

selecao = (dados_tipo == 'Casa') | (dados_tipo == 'Casa de Condomínio') | (dados_tipo == 'Cada de Vila')

n2 = dados[selecao].shape[0]

print(f'Imóveis classificados com tipos "Casa", "Casa de Condomínio" e "Casa de Vila": {n2}')

Imóveis classificados com tipos "Casa", "Casa de Condomínio" e "Casa de Vila": 1963

In [108]:
# Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites

selecao = (dados['Area'] >= 60) & (dados['Area'] <= 100)

n3 = dados[selecao].shape[0]

print(f'Imóveis com área entre 60 e 100 metros quadrados: {n3}')

Imóveis com área entre 60 e 100 metros quadrados: 8626

In [110]:
# Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00

selecao = (dados['Quartos'] >= 4) & (dados['Valor'] < 2000)

n4 = dados[selecao].shape[0]

print(f'Imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00: {n4}')

Imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00: 40

In [120]:
# Como selecionar dados: [seleção de linhas][[colunas]]
dados[:100][['Tipo', 'Valor']]

           Tipo    Valor
0     Quitinete   1700.0
1          Casa   7000.0
2   Apartamento    800.0
3   Apartamento    800.0
4   Apartamento   1200.0
..          ...      ...
95  Apartamento  25000.0
96  Apartamento   7500.0
97  Apartamento   2400.0
98  Apartamento   1350.0
99         Casa   7000.0

[100 rows x 2 columns]

In [136]:
# Selecionar os dados com a função loc [linha(s), coluna(s)]
dados.loc[[98, 99], ['Quartos', 'Valor']]

    Quartos   Valor
98        2  1350.0
99        8  7000.0

In [137]:
# Selecionar dados com base numérica, é encontrado dos valores através dos números de index [linha(s), coluna(s)]
dados.iloc[[98, 99], [0, 1]]

           Tipo          Bairro
98  Apartamento  Jardim Carioca
99         Casa        Maracanã